of40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/cCation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ciCation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 1;

boundaryField
{
    cyc0
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            fixedValue;
	value           uniform 1;       
    }
    
    membrane
    {
	type            fixedValue;
	value           uniform 2;       
    }

    cyc1
    {
	type            cyclic;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
