of40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{

    cyc0
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            fixedValue;
	value           uniform 3.10929256;      
    }
    
    membrane
    {
	type            fixedValue;
	value           uniform 0;       
    }

    cyc1
    {
	type            cyclic;    
    }

    frontAndBack
    {
	type            empty;     
    }
    
}

// ************************************************************************* //
